{
  "privacy": {
    "header": {
      "title": "HuLa Privacy Protection Guidelines",
      "updatedAt": "Updated on: September 3, 2025"
    },
    "sections": [
      {
        "title": "Introduction",
        "paragraphs": [
          "HuLa (hereinafter referred to as \"we\") fully understands the importance of personal information to you and will do everything possible to keep it safe and reliable. To earn and maintain your trust, we strictly abide by principles such as responsibility-consistency, explicit purpose, informed consent, minimal necessity, security assurance, subject participation, and openness and transparency. We also pledge to adopt industry-standard security measures to safeguard your personal information.",
          "Please read and understand these Privacy Protection Guidelines carefully before using our products or services."
        ]
      },
      {
        "title": "1. How We Collect and Use Your Personal Information",
        "paragraphs": [
          "Personal information refers to any kind of information that is recorded electronically or otherwise and can identify a specific natural person, either alone or in combination with other information, or that reflects the activities of a specific natural person."
        ],
        "subSections": [
          {
            "subtitle": "1.1 When We Collect Your Personal Information",
            "paragraphs": [
              "(1) Account registration: When you register a HuLa account, we collect your mobile number, email address, and other details to create the account.",
              "(2) Identity verification: To ensure account security, we may ask you to provide identity documents for real-name verification.",
              "(3) Service usage: While you use HuLa services, we collect your chat history, friend relationships, group information, etc.",
              "(4) Device information: We collect data such as device model, operating system version, and device identifiers to provide a better service experience."
            ]
          },
          {
            "subtitle": "1.2 How We Use Your Personal Information",
            "paragraphs": [
              "(1) Providing services: Including core features like instant messaging, file transfer, and audio/video calls.",
              "(2) Maintaining service security: Detecting and preventing security threats, fraud, and other illegal activities.",
              "(3) Improving service quality: Analyzing usage to optimize product features and user experience.",
              "(4) Customer service: Handling your inquiries, complaints, and feedback."
            ]
          }
        ]
      },
      {
        "title": "2. How We Use Cookies and Similar Technologies",
        "paragraphs": [
          "To ensure the proper operation of our services, we store small data files called cookies on your computer or mobile device. Cookies typically contain identifiers, site names, and a series of numbers and characters. They help websites save your preferences or shopping cart contents, among other data.",
          "We do not use cookies for purposes other than those described in this policy. You can manage or delete cookies based on your preferences. Most browsers allow you to clear cookies or block them, but doing so may require you to reconfigure user settings each time you visit our website."
        ]
      },
      {
        "title": "3. How We Share, Transfer, and Disclose Your Personal Information",
        "subSections": [
          {
            "subtitle": "3.1 Sharing",
            "paragraphs": [
              "We do not share your personal information with companies, organizations, or individuals outside of HuLa except in the following circumstances:",
              "(1) With your explicit consent or authorization;",
              "(2) When required by applicable laws, legal procedures, or mandatory governmental or judicial requests;",
              "(3) Within the scope permitted by law to protect the rights, property, or safety of HuLa, HuLa users, or the public;",
              "(4) With our affiliates: we may share your personal information with affiliated companies."
            ]
          },
          {
            "subtitle": "3.2 Transfer",
            "paragraphs": [
              "We will not transfer your personal information to any company, organization, or individual except in the following situations:",
              "(1) With your explicit consent or authorization;",
              "(2) During mergers, acquisitions, or bankruptcy proceedings, we will require the new entity holding your personal information to remain bound by this privacy policy."
            ]
          },
          {
            "subtitle": "3.3 Public Disclosure",
            "paragraphs": [
              "We will only disclose your personal information publicly in the following circumstances:",
              "(1) After obtaining your explicit consent;",
              "(2) For disclosures based on law: when required by laws, legal procedures, litigation, or governmental authorities."
            ]
          }
        ]
      },
      {
        "title": "4. How We Protect Your Personal Information",
        "paragraphs": [
          "(1) We use industry-standard security safeguards to protect the personal information you provide, preventing unauthorized access, disclosure, use, modification, damage, or loss.",
          "(2) We take all reasonable measures to ensure that no irrelevant personal information is collected.",
          "(3) We take all reasonable measures to ensure that personal information is not retained for longer than necessary to achieve the stated purposes.",
          "(4) The internet is not an absolutely secure environment, and communications such as emails, instant messages, or social software may not be fully encrypted."
        ]
      },
      {
        "title": "5. Your Rights",
        "paragraphs": [
          "In accordance with relevant laws, regulations, and common practices in China and other regions, we ensure that you can exercise the following rights regarding your personal information:"
        ],
        "subSections": [
          {
            "subtitle": "5.1 Access Your Personal Information",
            "paragraphs": [
              "You have the right to access your personal information, except as otherwise provided by laws and regulations."
            ]
          },
          {
            "subtitle": "5.2 Correct Your Personal Information",
            "paragraphs": [
              "When you discover errors in the personal information we process about you, you have the right to request corrections."
            ]
          },
          {
            "subtitle": "5.3 Delete Your Personal Information",
            "paragraphs": [
              "You may request deletion of personal information in the following situations:",
              "(1) If our handling of personal information violates laws or regulations;",
              "(2) If we collect or use your personal information without your consent;",
              "(3) If our handling of personal information breaches our agreement with you."
            ]
          },
          {
            "subtitle": "5.4 Change the Scope of Your Authorization",
            "paragraphs": [
              "Each business function requires certain essential personal information. For any additional data collection or usage, you may grant or withdraw consent at any time."
            ]
          }
        ]
      },
      {
        "title": "6. How We Handle Children's Personal Information",
        "paragraphs": [
          "Our products, websites, and services are primarily intended for adults. Children may not create their own user accounts without the consent of their parents or guardians.",
          "For personal information collected from children with parental consent, we will use or disclose it only when permitted by law, with explicit parental or guardian approval, or when necessary to protect the child."
        ]
      },
      {
        "title": "7. Global Transfer of Your Personal Information",
        "paragraphs": [
          "In principle, personal information collected and generated in the People's Republic of China will be stored within China.",
          "Because we provide products or services through resources and servers around the world, your personal information may be transferred to, or accessed from, jurisdictions outside the country/region where you use the services, after obtaining your authorization."
        ]
      },
      {
        "title": "8. How This Policy Is Updated",
        "paragraphs": [
          "Our privacy policy may change.",
          "Without your explicit consent, we will not diminish your rights under this privacy policy. We will post any changes on this page.",
          "For major changes, we will also provide more prominent notices (including email notifications for certain services describing the specific changes)."
        ]
      },
      {
        "title": "9. Open-Source Project Disclaimer",
        "paragraphs": [
          "This project is provided as an open-source project. To the fullest extent permitted by law, the developers make no explicit or implied warranties regarding functionality, security, or suitability.",
          "You expressly understand and agree that your use of this software is entirely at your own risk. The software is provided \"as is\" and \"as available,\" without any express or implied warranties, including but not limited to merchantability, fitness for a particular purpose, or non-infringement.",
          "In no event shall the developers or their suppliers be liable for any direct, indirect, incidental, special, punitive, or consequential damages, including but not limited to lost profits, business interruption, personal information leaks, or other commercial losses arising from the use of this software.",
          "Any users who perform secondary development on this project must commit to using the software for lawful purposes and are solely responsible for complying with local laws and regulations.",
          "The developers reserve the right to modify the software's features or any part of this disclaimer at any time, and such changes may be delivered through software updates."
        ]
      },
      {
        "title": "10. Final Interpretation",
        "paragraphs": [
          "The final right of interpretation of these Privacy Protection Guidelines rests with the author."
        ]
      }
    ]
  },
  "server": {
    "header": {
      "title": "HuLa Service Agreement",
      "updatedAt": "Updated on: September 3, 2025"
    },
    "sections": [
      {
        "title": "1. Confirmation and Acceptance of Service Terms",
        "paragraphs": [
          "Welcome to HuLa! All electronic services of HuLa are owned and operated by HuLa. Users must fully agree to all terms of service and complete the registration process to become official HuLa users."
        ]
      },
      {
        "title": "2. Service Overview",
        "paragraphs": [
          "HuLa is a free instant messaging application that allows users to chat via text, voice, and video, as well as share images and files. HuLa is committed to providing secure, stable, and convenient communication services."
        ]
      },
      {
        "title": "3. User Registration",
        "paragraphs": [
          "3.1 Users must provide authentic, accurate, and complete personal information when registering.",
          "3.2 Users are responsible for the security of their passwords and accounts. Any losses or damages resulting from activities conducted through the account are borne solely by the user.",
          "3.3 Users agree to receive information from HuLa, including but not limited to product updates, service announcements, and special offers."
        ]
      },
      {
        "title": "4. User Conduct",
        "paragraphs": [
          "4.1 Users must comply with applicable laws and regulations of the People's Republic of China while using HuLa services.",
          "4.2 Users are prohibited from using HuLa services for unlawful activities.",
          "4.3 Users may not publish or disseminate unlawful, harmful, threatening, abusive, harassing, infringing, defamatory, vulgar, obscene, or otherwise objectionable content.",
          "4.4 Users may not publish or disseminate content that infringes the intellectual property or other rights of third parties.",
          "4.5 Users may not maliciously spread viruses, trojans, or other malicious programs."
        ]
      },
      {
        "title": "5. Privacy Protection",
        "paragraphs": [
          "5.1 HuLa attaches great importance to user privacy. Unless otherwise required by law, HuLa will not disclose or transfer user information to third parties without consent.",
          "5.2 HuLa adopts industry-standard security measures to protect user information from unauthorized access, use, or disclosure.",
          "5.3 Users understand and agree that HuLa may collect and use relevant information to provide better services."
        ]
      },
      {
        "title": "6. Intellectual Property",
        "paragraphs": [
          "6.1 HuLa and its related technologies, trademarks, and copyrights are owned by HuLa.",
          "6.2 Without written permission from HuLa, users may not perform reverse engineering, disassembly, or decompilation on the software.",
          "6.3 Users retain intellectual property rights over the content they publish via HuLa, but grant HuLa a worldwide, royalty-free, non-exclusive license to use such content."
        ]
      },
      {
        "title": "7. Disclaimer",
        "paragraphs": [
          "7.1 Users agree that they use HuLa services entirely at their own risk.",
          "7.2 HuLa does not guarantee that the service will meet users' requirements, nor does it guarantee uninterrupted service.",
          "7.3 HuLa assumes no responsibility for any network service interruptions or defects caused by force majeure or reasons beyond HuLa's control."
        ]
      },
      {
        "title": "8. Service Changes, Interruptions, or Termination",
        "paragraphs": [
          "8.1 HuLa reserves the right to change, suspend, or terminate part or all of its services based on business needs.",
          "8.2 If services must be paused for maintenance or upgrades, HuLa will provide prior notice whenever possible.",
          "8.3 If a user violates any term of this agreement, HuLa may terminate service to that user."
        ]
      },
      {
        "title": "9. Modifications to the Agreement",
        "paragraphs": [
          "HuLa may modify any terms of this agreement at any time. When changes occur, HuLa will notify users appropriately. If you do not agree with the changes, you may stop using the services. Continued use constitutes acceptance of the modifications."
        ]
      },
      {
        "title": "10. Governing Law and Dispute Resolution",
        "paragraphs": [
          "10.1 The formation, execution, interpretation, and dispute resolution related to this agreement are governed by the laws of the People's Republic of China.",
          "10.2 In the event of disputes, both parties should attempt to resolve them through friendly negotiation. If negotiations fail, either party may file a lawsuit with the People's Court located in HuLa's jurisdiction."
        ]
      },
      {
        "title": "11. Open-Source Project Disclaimer",
        "paragraphs": [
          "This project is provided as an open-source project. To the fullest extent permitted by law, the developers make no explicit or implied warranties regarding functionality, security, or suitability.",
          "You expressly understand and agree that your use of this software is entirely at your own risk. The software is provided \"as is\" and \"as available,\" without any express or implied warranties, including but not limited to merchantability, fitness for a particular purpose, or non-infringement.",
          "In no event shall the developers or their suppliers be liable for any direct, indirect, incidental, special, punitive, or consequential damages, including but not limited to lost profits, business interruption, personal information leaks, or other commercial losses arising from the use of this software.",
          "Any users who perform secondary development on this project must commit to using the software for lawful purposes and are solely responsible for complying with local laws and regulations.",
          "The developers reserve the right to modify the software's features or any part of this disclaimer at any time, and such changes may be delivered through software updates."
        ]
      },
      {
        "title": "12. Final Interpretation",
        "paragraphs": ["The final right of interpretation of this agreement rests with the author."]
      }
    ]
  }
}
