export const content = `
HuLa 隐私保护指引
一、引言
    HuLaSpark 开源组织（以下简称 “我们”）非常重视你的隐私保护。本隐私保护指引旨在向你说明我们在提供 HuLa 即时通讯系统（以下简称 “本服务”）过程中如何收集、使用、存储和共享你的个人信息。请你在使用本服务前仔细阅读本指引。
二、个人信息的收集
    1.注册信息
        当你注册 HuLa 账号时，我们会收集你的手机号码、电子邮箱地址、用户名、密码等信息，以便为你创建和管理账号。
    2.使用信息
        在你使用本服务过程中，我们会收集你的使用记录，包括但不限于消息内容、聊天记录、登录时间、IP 地址等，以便为你提供更好的服务和优化用户体验。
    3.设备信息
        我们会收集你的设备信息，如设备型号、操作系统版本、设备标识符等，用于设备适配和安全防护。
三、个人信息的使用
    1.我们会使用你提供的个人信息为你提供本服务，包括但不限于身份验证、消息推送、个性化设置等。
    2.我们可能会使用你的个人信息进行数据分析和统计，以改进服务质量和优化功能。
    3.在获得你的同意后，我们可能会使用你的个人信息向你发送相关的营销信息。
四、个人信息的存储
    1.我们会将你的个人信息存储在安全的服务器上，并采取必要的技术和管理措施保护你的信息安全。
    2.我们会根据法律法规的要求和业务需要，保留你的个人信息一段合理的时间。
五、个人信息的共享
    1.我们不会将你的个人信息共享给第三方，除非符合以下情况：
        获得你的明确同意；
        为了提供本服务的必要，与合作伙伴共享；
        根据法律法规的要求或司法机关的指令提供。
    2.若与第三方共享你的个人信息，我们会要求第三方采取必要的措施保护你的信息安全。
六、你的权利
    1.访问和修改：你有权访问和修改自己的个人信息。你可以通过本服务的设置功能进行操作。
    2.删除：在符合法律法规的情况下，你有权要求我们删除你的个人信息。
    3.拒绝营销：你有权拒绝我们向你发送的营销信息。
七、安全措施
    我们采取了一系列安全措施来保护你的个人信息，包括但不限于数据加密、访问控制、安全审计等。但请你注意，互联网并非绝对安全的环境，我们不能保证信息的绝对安全。
八、隐私保护指引的变更
    我们有权根据业务需要对本隐私保护指引进行变更。变更后的指引将在我们的官方网站或应用内公布。若你继续使用本服务，即视为你同意变更后的指引。
`
