export const content = `
服务协议
一、引言
欢迎使用 HuLa 即时通讯系统（以下简称 “本服务”）。本服务协议（以下简称 “协议”）是你与 HuLaSpark 开源组织（以下简称 “我们”）之间就使用本服务所达成的协议。请你在使用本服务前仔细阅读本协议的所有条款，如果你不同意本协议的任何条款，请勿使用本服务。
二、服务内容
    我们通过 HuLa 为你提供即时通讯服务，包括但不限于文字、语音、图片、视频等消息的发送和接收，以及群组聊天、好友管理等功能。我们会不断改进和优化服务，可能会增加或减少某些功能。
三、使用规则
    1.账号注册与使用
        你需要提供真实、准确、完整的个人信息进行账号注册。如果信息发生变更，你应及时更新。
        你应对自己的账号和密码负责，不得将账号转让、出租或出借给他人使用。若因账号使用不当导致的任何损失，由你自行承担。
    2.内容发布
        你在使用本服务时发布的内容应遵守法律法规和社会公德，不得发布违法、违规、侵权、淫秽、暴力、歧视等不良内容。
        我们有权对你发布的内容进行审核，若发现违反规定的内容，有权采取删除、限制账号使用等措施。
    3.遵守法律法规
        你在使用本服务时应遵守中华人民共和国的法律法规，不得利用本服务进行任何违法犯罪活动。
四、服务变更、中断或终止
    我们可能会根据业务需要对服务进行变更、升级或维护，可能会导致服务中断或暂停。我们会尽可能提前通知你。
    若你违反本协议或相关法律法规，我们有权终止你的服务使用权限。
五、知识产权
    本服务的所有内容，包括但不限于软件、文字、图片、音频、视频等，均受知识产权法律法规的保护。未经我们书面许可，你不得擅自复制、传播、修改或用于其他商业用途。
六、责任限制
    我们会尽力确保服务的稳定性和可靠性，但不保证服务不会出现故障、中断或错误。对于因不可抗力、技术故障等原因导致的服务问题，我们不承担责任。
    你在使用本服务过程中应自行判断信息的真实性和可靠性，对于因你使用不当或依赖错误信息而导致的损失，我们不承担责任。
七、免责声明
    1. 本项目是作为一款开源项目提供的，开发者在法律允许的范围内不对软件的功能性、安全性或适用性提供任何形式的明示或暗示的保证
    2. 用户明确理解并同意，使用本软件的风险完全由用户自己承担，软件以"现状"和"现有"基础提供。开发者不提供任何形式的担保，无论是明示还是暗示的，包括但不限于适销性、特定用途的适用性和非侵权的担保
    3. 在任何情况下，开发者或其供应商都不对任何直接的、间接的、偶然的、特殊的、惩罚性的或后果性的损害承担责任，包括但不限于使用本软件产生的利润损失、业务中断、个人信息泄露或其他商业损害或损失
    4. 所有在本项目上进行二次开发的用户，都需承诺将本软件用于合法目的，并自行负责遵守当地的法律和法规
    5. 开发者有权在任何时间修改软件的功能或特性，以及本免责声明的任何部分，并且这些修改可能会以软件更新的形式体现
`
